<template><div><h1 id="安装整合包" tabindex="-1"><a class="header-anchor" href="#安装整合包" aria-hidden="true">#</a> 安装整合包</h1>
<hr>
<blockquote>
<p>整合包 毫无疑问是最适合萌新游玩的资源，可拓展性使整合包也多种多样：有帮助萌新入门的基础整合包 、也有适合老玩家狂肝的大型整合包 等等……</p>
<p>接下来我们将学会如何通过整合包安装游戏。</p>
</blockquote>
<ol>
<li>
<p>下载一个整合包：</p>
<ul>
<li>
<p>导航栏中的整合包下载区提供了链接以下载整合包。</p>
</li>
<li>
<p>不熟悉英文的可以自行往整合包里加入 汉化 Mod，即可汉化大部分常见的 Mod。</p>
</li>
</ul>
</li>
<li>
<p>安装整合包：</p>
<ul>
<li>
<p>首先我们检查下载好的整合包（一般为后缀 .zip、.rar 或 .7z），用解压缩软件打开（没有的请在 资源收录区 里找到 BandiZip 或 7-Zip安装包并下载安装），</p>
</li>
<li>
<p>如果里面有 .minecraft 根目录及一个启动器，那只需解压进一个空白文件夹即可，</p>
</li>
<li>
<p>如果里面是 config 等一堆乱七八糟的文件夹（其实是 .minecraft 根目录里的文件），那么需要将它拖入 HMCL 安装，或在 PCL2 的安装页面点安装整合包，再选择这个整合包，</p>
</li>
<li>
<p>没有启动器可以在 资源收录区 里下载。</p>
</li>
</ul>
</li>
<li>
<p>解压/安装 完成后，打开启动器即可开始游戏。</p>
</li>
</ol>
</div></template>
